app/views/books/index.html.erb

						      <div class="fa fa-heart" aria-hidden="true" style="color: red;"></div>
						      <%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

						      <div class="fa fa-heart-o" aria-hidden="true"></div>
						      <%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

						<% end %>
						<td><%= book.book_comments.count %>件コメント</td>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]