app/views/books/show.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
				<td><%= @book_detail.body %></td>
		        <td><%= @book_detail.book_comments.count %>件コメント</td>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
				      <div class="fa fa-heart" aria-hidden="true" style="color: red;"></div>
				      <%= @book_detail.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
				      <div class="fa fa-heart-o" aria-hidden="true"></div>
				      <%= @book_detail.favorites.count %> いいね

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
		<ol>
		    <% @book_detail.book_comments.each do |book_comment| %>