app/controllers/book_comments_controller.rb

	def create
	    book = Book.find(params[:book_id])
	    comment = current_user.book_comments.new(post_comment_params)
	    comment.book_id = book.id
	    comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "created_at", "updated_at", "book_id") VALUES (?, ?, ?, ?, ?)  [["comment", "test"], ["user_id", 1], ["created_at", "2020-03-14 05:14:31.725814"], ["updated_at", "2020-03-14 05:14:31.725814"], ["book_id", 1]]

    def destroy
        comment = BookComment.find(params[:book_id])
        comment.destroy
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 2]]