app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
  	@users = User.all #一覧表示するためにUserモデルのデータを全て変数に入れて取り出す。
    @user = User.find(current_user.id)